english/vocabulary.org
#+OPTIONS: toc:1 ^:nil ~:nil num:nil reveal_title_slide:nil timestamp:nil
#+TAGS: AWL(a)

Record my english study process.
1. C represent less 1000 occur on youtube

* break
:PROPERTIES:
:EXPORT_FILE_NAME: break.md
:END:
使破裂
** 语义
*** 使破裂
I had to break a window to get into the house.
*** 使骨折
She fell downstairs and broke her hip.
*** 弄坏
Someone's broken the TV.
*** 损坏
The washing machine's broken again.
*** 违犯
They're breaking the law by employing such young children.
*** 违反
I never break my promises.
*** 休息
Shall we break for lunch now?
*** 打断
We need to break the cycle of poverty and crime in the *inner cities*.
*** 打垮
Losing his business nearly broke him.
*** 摧毁
The government succeeded in breaking the unions.
*** 破晓
*Dawn* was breaking by the time we arrived home.
*** 来临
We were keen to get back to the hotel before the storm broke.
*** 天气突然变化
The following day the weather broke and we had ten days of soild rain.
*** 拍岸
We sat and watched the waves breaking on the *shore*.
*** 变声
He was fifteen, and his voice was just begining to break.
*** 传开
News of his *resignation* broke yesterday.
*** 告诉
I didn't know how I was going to break the news to my monther.
*** 休息
We'll have a short break for lunch, then start again at two o'clock.
*** 中断
She decided to take a career break when she had children.
*** 短假期
I was beginning to feel that I needed a break.
*** 课间休息
I'll speak to you at break.
*** 广告时间
Join us again after the break.
*** 暂停
We'll go for a walk if there's a break in the rain.
*** 断绝
I wanted a clean break so that I could restart my life.
*** 裂口
We crawled through a break in the *hedge*.
*** 骨折
It's quite a bad break, which will take serveral months to heal.
*** 破发
She really needs a break of serve now if she wants to win this match.
** 短语
*** break a habit
A new drug which helps smokers to break their habit.

https://youglish.com/getbyid/16162985/break%20a%20habit/english
*** break a record
He break the 10,000-metres world record.

https://youglish.com/getbyid/89314518/break%20a%20record/english
*** break a journey
We decided to break our journey in Oxford.
*** break somebody's heart
He broke my heart when he left me.

https://youglish.com/getbyid/89245671/break%20my%20heart/english
*** break a strike
The government has threatened to bring in the army to break the 10-month-old strike.

https://youglish.com/getbyid/102464967/break%20a%20strike/english
*** break a link
The US has now broken all diplomatic links with the regime.

https://youglish.com/getbyid/8843357/break%20a%20link/english
*** break the skin
Their teeth are sharp enough to break the skin.

https://youglish.com/getbyid/103191141/break%20the%20skin/english
*** break the back of something
I think we've broken the back of the job now.

https://youglish.com/getbyid/127418171/break%20the%20back%20of/english
*** break the bank
A new hard drive doesn't have to break the bank.

https://youglish.com/getbyid/27242985/break%20the%20bank/english
*** break somebody's concentration
The slightest sound would break his concentration.

https://youglish.com/getbyid/33332000/break%20concentration/english
*** break the ice
Sam's arrival broke the ice and people began to talk and laugh.

https://youglish.com/getbyid/66125906/break%20the%20ice/english
*** break a code
Scientists worked day and night to break the code.

https://youglish.com/getbyid/33470724/break%20a%20code/english
*** break wind
*** break serve
Hewitt broke serve twice in the second set.
*** break away
More than 30 Labour MPs broke away to form a new left-wing party.

https://youglish.com/getbyid/102379561/break%20away/english
*** break down
**** 故障
The car broke down just north of Paris.
**** 失败
Negotiations broke down after only two days.
**** 撞倒
Police had to break down the door to get into the flat.

https://youglish.com/getbyid/16861513/break%20down/english
**** 消除
Getting young people together will help to break down the barriers between them.

**** 分解
Food is broken down in the stomach.

https://youglish.com/getbyid/128778736/break%20down/english
**** 禁不住哭出来
She broke down in tears when she heard the news.
**** 拆分
He showed us the whole dance, then broke it down so that we could learn it more easily.

https://youglish.com/getbyid/19634216/break%20down/english
*** break for
He broke for the door, but the guards got there before he did.

https://youglish.com/getbyid/19831620/break%20for/english
*** break in
**** 闯入
Thieves broke in and stole $10000 worth of computer equipment.

https://youglish.com/getbyid/24811498/break%20in/english
**** 插话
I didn't want to break in on his telephone conversation.
**** 使...合脚
I went for a walk to break in my new boots.
**** 训练小马驮人
We break the horses in when they're about two years old.
*** break into
**** 闯入
Someone broke into my car and stole the radio.

https://youglish.com/getbyid/8634886/break%20into/english
**** 进入
She made an attempt to break into jounalism.
**** 动用
I don't want to break into my savings unless I have to.
**** 突然奔跑
He broke into a run as he came round the corner.
**** 突然笑起来
He face broke into a smile.
*** break somebody of something
Try to break yourself of the habit of eating between meals.
*** break off
**** 停顿
She started to speak, then broke off while a waitress served us coffee.
**** 结束
She broke off their angagement only a few weeks before they were due to be married.
**** 使脱落
One of the car's wing mirrors had broken off.

https://youglish.com/getbyid/3023946/break%20off/english
*** break out
**** 爆发
I was still living in London when the war broke out.

https://youglish.com/getbyid/159524925/break%20out/english
**** 越狱
Three man have broken out of a top-security jail.
**** 摆脱
She felt the need to break out of her daily routine.

https://youglish.com/getbyid/89072771/break%20out/english
**** 出汗
My whole body broke out in a sweat.
*** break through
https://youglish.com/getbyid/15181140/break%20through/english
**** 突破某物
Seveal demonstrators broke through the barriers despite warnings from the police.
**** 冲破
The sun broke through at around lunch time.
**** 突破
He's a very talented young actor who's just ready to break through.
*** break up
https://youglish.com/getbyid/77887576/break%20up/english
**** 使碎裂
It seems that the plane just broke up in the air.
**** 分拆
There are plans to break the company up into several smaller independent companies.
**** 阻止
Three policemen were needed to break up the fight.
**** 驱散
Government sholiders broke up the demonstration.
**** 散伙
The couple broke up last year.
**** 散会
The party didn't break up until after midnight.
**** 放假
School breaks up next week.
**** 使某人大笑
He breaks me up!
*** break with
https://youglish.com/getbyid/73420440/break%20with/english
**** 与...断绝关系
She had broken with her family years ago.
**** 与过去决裂
Now is the time to break with the past.
*** give somebody a break
Give the kid a break. It's only his second day on the job.

https://youglish.com/getbyid/13771896/give%20he%20a%20break/english
